Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/MediaConf/AddVideoEncoderConfiguration/TC.MC.NVT.14_REQ_01.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trt:AddVideoEncoderConfiguration>
      <trt:ProfileToken>testprof0</trt:ProfileToken>
      <trt:ConfigurationToken>encoder1</trt:ConfigurationToken>
    </trt:AddVideoEncoderConfiguration>
  </soap:Body>
</soap:Envelope>